[
  {
    "url": "https://fin.ai/",
    "content": "Fin. The #1 AI Agent for customer service AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialThe #1 AI Agentfor customer service#1 in performance benchmarks#1 in competitive bake-offs#1 ranking on G2Start free trialView demoMoneyboxCulture AmpClayLightspeedAnthropicMonday.comAmplitudeSynthesiaLaunchDarklyCodaShutterstockLovableConsensysAspireMarshmallowMoneyboxCulture AmpClayLightspeedAnthropicMonday.comAmplitudeSynthesiaLaunchDarklyCodaShutterstockLovableConsensysAspireMarshmallowFin is the best-performing AI Agent for customer service, [1] delivering higher-quality customer experiences and higher resolution rates than any other AI Agent. [2] [1] #1 AI Agent on G2See '25 Spring Report[2] SystemSee all featuresAI Agent SystemComplete, fully configurableAI Agent System01Fin is the only complete, fully configurable AI Agent System in customer service—empowering support teams to customize, test, and continuously improve Fin through a no-code user experience anyone can manage.Explore all capabilitiesAnalyzeTrainTestDeployAnalyzeMonitor, analyze, and optimize Fin by spotting trends, filling content gaps, and fixing quality issues topic by topic.Featured CapabilitiesFin performance reportCustomer Experience ScoreHolistic reportingFin custom reportingTopics ExplorerFin unresolved questions reportConversation monitoringOptimize Fin dashboardSuggestionsLearn MoreTrainCustomize Fin's tone of voice, teach it your support knowledge and policies, and configure how it handles complex tasks in over 45 languages.Featured CapabilitiesMulti-source generative answersKnowledge sourcesFin knowledge managementFin GuidanceTone of voiceMultilingualReal-time translationContent targetingFin TasksPersonalized answersData connector templatesFin VisionTestTest answers, review the sources and settings that shape them, and get tailored recommendations to optimize performance.Featured CapabilitiesBatch testingAnswer ratingFin previewAnswer inspectionAudience testingDeployFrom email and live chat to phone, SMS, and social—Fin can answer any question, across any channel, any time.Featured CapabilitiesFin VoiceFin over live chatFin over emailFin over APIFin over WhatsApp & SMSFin over SocialFin over SlackWorkflows for FinHuman handoffAudience targetingUsage limits and notificationsUnrivalled PerformanceFin outperforms every competitor.Every time.Fig 2.A - Fintech CustomerFin is in a completely different league. It’s now involved in 99% of conversations and successfully resolves up to 65% end-to-end—even the more complex ones.Angelo Livanos, Senior Director of Global Support at LightspeedFig 2.B - Fin wins every head-to-head test ON RESOLUTION RATEResolution rate based on independent testing conducted by Fin customers.Chosen by the world’s leading AI companiesDelivers industry-leading performanceFig 2.C - Number of conversations successfully resolved by Fin​​0123456789,012345678901234567890123456789,012345678901234567890123456789​​Fig 2.D - Fin's average resolution rate increases 1% every monthFig 2.E - FIN continuously improves over timeSuperior TechnologyPowered by the Fin AI Engine™03 The Fin AI Engine™ is a patented AI architecture specifically engineered for customer service. Every layer is optimized for precision, speed, and reliability—so Fin can resolve more conversations, more effectively than competing AI AgentsFig 3.A -  Fin AI Engine™refine the querygenerate a responsevalidate accuracyengine optimization[3.a.1] Refine the queryIn order to optimize the accuracy of an answer that an LLM generates, the inputs the LLM receives must be refined for comprehension[3.a.2] Generate a responseTo generate a response, the Fin AI Engine™ uses a bespoke, enhanced retrieval-augmented generation (RAG) architecture[3.a.3] Validate accuracy In the final step, the Fin AI Engine™ checks whether the LLM output meets response accuracy and safety standards[3.a.4] Engine optimizationTo calibrate performance, the Fin AI Engine™ uses integrated tools that optimize answer generation, efficiency, precision, and coverageLearn moreTrusted and fully certifiedAI TeamBuilt by a world-class team of AI experts04 The AI Group, an expert team of over 40 machine learning scientists, engineers and designers, continuously optimize Fin’s performance through cutting-edge research, experimentation, and innovation—and publish their insights in the AI research blogAI Group LeadershipPratik BothraPrincipal Machine Learning EngineerRob ClancyStaff Product EngineerMario KostelacPrincipal Machine Learning EngineerMolly MaharPrincipal AI DesignerBrian McDonnellDirector, EngineeringFedor ParfenovStaff Machine Learning ScientistFergal ReidVP AIPedro TabacofPrincipal Machine Learning ScientistAlexey TarasovSenior Manager, ML EngineeringRati ZvirawaDirector, Product ManagementSeamless integrationFin works with any helpdesk04 Set up Fin with your existing helpdesk or as part of the Intercom Customer Service Suite—with support for additional platforms and custom channels.Learn moreKey featuresSet up in under an hour.Integrates into your current support channels—tickets, email, live chat, and more.Follows your existing assignment rules, automations, and reporting.Escalates to agents in your preferred inbox.Learn moreGet the #1 AI Agentfor customer service#1 AI Agent on G2FIN MILLION DOLLAR GUARANTEEFin with your  current helpdeskFin AI Agent works seamlessly with any helpdesk, including Zendesk, Salesforce, HubSpot, and more.$0.99per resolution 50 resolutions per month minimumFree 14 day trialGet a demoFin withIntercom’s HelpdeskCombine Fin AI Agent with Intercom’s Helpdesk to get the full Intercom Customer Service Suite.$0.99per resolution+$29per helpdesk seat per month (see all plans)Free 14 day trialGet a demoGet started with the #1 AI Agent todayStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/insights",
    "content": "Fin. The #1 AI Agent for customer service | Fin Insights AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialA new era of Insights has arrivedhas arrivedFin Insights is a groundbreaking, AI-powered product that gives you complete, real-time visibility across your entire customer experience.Start free trialView demoFin Insights combines CX Score—a breakthrough metric for measuring support quality—with dashboards to help you monitor performance, explore Topics, and optimize Fin with AI-powered Suggestions. CX ScoreCX Score: The new standard for support quality01CX Score is a breakthrough, AI-powered metric that gives you a complete view of your support quality across every customer conversation—no surveys required.Fig 1.FGet a complete view of your support qualityCX Score analyzes every conversation—giving you 5x more coverage than CSAT.Transparent, AI-powered scoringEvery conversation is scored in real time from 1 to 5 based on resolution, sentiment, and service quality, and comes with a clear explanation of the rating.Unbiased, accurate, and trustworthyValidated through rigorous quantitative and qualitative testing, CX Score shows strong accuracy and alignment with human ratings.CSAT was giving us a narrow, often confusing signal. With CX Score, we're seeing every conversation clearly—what actually happened, how the customer felt, and what we can do better.Jared EllisSenior Director, Global Product SupportPerformance DashboardA complete view of Fin’s performance02The Performance Dashboard brings Fin’s key support metrics—resolution rate, involvement rate, and CX Score—into one view. It helps teams monitor Fin’s performance, catch issues early, and communicate impact clearly across the business.Fig 2.AGet a high-level view of how Fin is performingSee how often Fin resolves issues, hands off to human agents, and how those conversations were experienced. Know where Fin works and where it can improveSee where Fin is succeeding and where it hands off—so you can identify gaps, improve training, or adjust workflows.Measure efficiency and experience togetherTrack resolution rate alongside CX Score, so you can balance efficiency and customer experience.Topics ExplorerExplore trends and insights across your customer conversations03Topics Explorer uses AI to organize every single customer conversation into Topics and Subtopics, giving you an unprecedented view of what's driving support volume and impacting quality. Spot patterns, track trends, and catch emerging issues early.Fig 3.aAI-Generated TopicsAI automatically organizes all your support conversations into Topics and Subtopics, so you can easily spot trends, surface issues, and uncover insights.Fig 3.bSurface areas driving poor experienceFilter topics by CX Score, resolution rate, handling time, and more to identify problem areas before they affect customer experience. Trendlines reveal changes over time, so you can catch issues early.Fig 3.cDrill into Topics to understand what went wrongInvestigate low scoring Topics by clicking in to get specific and actionable Subtopics. Identify patterns in Subtopics, and view all related conversations to understand what is going on.With nearly 10,000 tickets a month, understanding customer feedback at scale was really difficult—until Topics Explorer helped us cut through the noise.George DiltheyHead of Support at ClayOptimize DashboardAI Suggestions for effortless performance improvement04The Optimize Dashboard features AI-powered Suggestions that highlight opportunities to improve Fin’s performance. Accept with one click for instant optimization.Fig 4.aVisualize opportunities for optimizing FinThe Optimize Dashboard surfaces gaps in content, data connections, and actions—showing where Fin could have handled conversations that instead went to your team.Fig 4.bGet clear, AI-powered SuggestionsSuggestions provide edits, additions, and optimizations to Fin’s help content based on how your human agents resolved similar queries. Each Suggestion includes a clear explanation and a ready-to-publish update.Fig 4.cOne-click and Fin improves its answersEach Suggestion includes a clear explanation and pre‑written updates. You can review, accept, or edit with a click—and Fin's answers will immediately get better.Get groundbreaking, AI-powered Insights todayStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/pricing",
    "content": "Start a 14-day free trial of Fin today AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialGet the #1 AI Agent with any helpdesk#1 AI Agent on G2FIN MILLION DOLLAR GUARANTEEFin with your  current helpdeskFin AI Agent works seamlessly with any helpdesk, including Zendesk, Salesforce, HubSpot, and more.$0.99per resolution 50 resolutions per month minimumFree 14 day trialGet a demoKey features include:Set up in under an hourHandles tickets, cases, emails, live chat, WhatsApp, SMS, and moreCustomizable tone and answer lengthTakes action to update external systemsTransfers to agents directly in preferred InboxFin withIntercom’s HelpdeskCombine Fin AI Agent with Intercom’s Helpdesk to get the full Intercom Customer Service Suite.$0.99per resolution+$29per helpdesk seat per month (see all plans)Free 14 day trialGet a demoEvery Fin AI Agent feature, plus:Configurable Inbox and Ticketing systemEmail, live chat, phone, SMS, and moreWorkflows automations & pre-built reportingPublic Help Center and Knowledge HubProactive Outbound SuiteAdd onCopilotIncrease agent efficiency with a personal AI assistant in the inbox.$35Per user Per monthKey features include:Instant advice, insights, and answers for agentsExpert training and onboardingTrusted information from your content sourcesProvide global support with AI-translationsFaster time to resolutionLearn moreStartupsStartups get 90% off  Intercom + 1 year of Fin freeApply nowTrusted by thousands of customer service leadersMoneyboxCulture AmpClayLightspeedAnthropicMonday.comAmplitudeSynthesiaLaunchDarklyCodaShutterstockLovableConsensysAspireMarshmallowMoneyboxCulture AmpClayLightspeedAnthropicMonday.comAmplitudeSynthesiaLaunchDarklyCodaShutterstockLovableConsensysAspireMarshmallowCapabilitiesEvery industry-leading capability includedFin comes with the industry’s most comprehensive features & capabilities that allow you to continuously improve Fin’s performance over time.AnalyzeIdentify opportunities to fine-tune performance with AI insights.Fin performance reportCustomer experience scoreHolistic reportingFin custom reportingTopics and subtopicsUnresolved questions reportConversation monitoringOptimize Fin dashboardSuggestionsTrainShape Fin’s behavior, tone, and actions to match your best agents.Multi-source generative answersKnowledge sourcesFin knowledge managementFin GuidanceTone of voiceMultilingualReal-time translationsContent targetingFin TasksPersonalized answersData connector templatesFin VisionTestPreview and improve Fin’s responses to real customer questions.Batch testingAnswer inspectionAnswer ratingFin previewAudience testingDeployLaunch Fin across any channel your customers need support.Fin VoiceFin over emailFin over live chatFin over APIFin over SlackFin over WhatsApp & messengerFin over socialWorkflows for FinHuman handoffTargeting & schedulingUsage limits and notificationsTransparent pricingSimple, transparent pricing that scalesFin’s pricing aligns cost with value—only pay when Fin resolves a conversation. No setup, integration, or platform fees.Calculate potential savingsResolution-based pricingOnly pay when Fin successfully resolves a conversation—no hidden fees.Control built inManage usage with configurable alerts, limits, and real time reporting.Value that compoundsAs Fin handles more conversations, your support costs go down—without sacrificing quality.FAQSFAQsWhat is Fin AI Agent?▼Fin AI Agent is an advanced AI Agent that provides fast, accurate answers to customers 24/7 via live chat, email, SMS, WhatsApp, social and more. Fin is the highest-performing AI Agent for customer service, delivering higher-quality answers and resolving more complex queries than any other AI Agent.\nFin is powered by the patented Fin AI Engine™, an AI architecture specifically engineered for customer service. Every layer is optimized for precision, speed, and reliability—so Fin can resolve more conversations, more effectively than competing AI Agents.\nAll Intercom Customer Service Suite plans include access to Fin, and pricing is simple: $0.99 per resolution.Which helpdesks does Fin AI Agent integrate with?▼Fin integrates seamlessly with any platform—whether you're using Intercom or another customer support solution. Set it up in under an hour and start resolving tickets, cases, emails, and messages across every channel, right out of the box.\nYou can use Fin with:\n\nIntercom\nZendesk\nSalesforce\nHubSpot\nFreshworks\nDixa\nFront\nZoho\nSprinklr\nGorgias\n\nPlus, we support additional platforms and custom channels.How does pricing on my preferred helpdesk work? (Zendesk, Salesforce and more)▼We have adopted a simple model to strike a balance between affordability and sustainability:\n\n$0.99 per Fin resolution\n50 resolutions per month minimum.\nUnlimited teammates – No additional seat costs.\n\nThere are no additional costs, such as integration fees, setup fees, or platform charges.\nYou can add Copilot to any integration for $35 per month (subject to the Additional Product Terms for AI Products).\nLearn more about resolution pricing here.How does Intercom Customer Service Suite pricing work?▼When purchasing the Intercom Customer Service Suite you’ll choose from three plans: Essential, Advanced, or Expert. The plan you choose determines your seat price. You’ll then be charged based on the number of teammates who require Full seats. Full seats provide complete access to all features in your plan and are charged per teammate.\nLite seats are free of charge. You can learn more about Seat types here.\nAll our plans include access to:\nFin AI Agent: $0.99 per resolution—pay only for resolved customer conversations.\nMessaging channels: Usage-based pricing for SMS, phone, product tours, and more. Learn more here.How does the free trial work?▼Free trials require no credit card to sign up. During the 14-day trial, you’ll have unlimited access to Fin resolutions, with no limits on usage. There are no seat minimums or maximums, so you can get started with as many teammates as you'd like.\nTo continue using Fin after your trial ends, simply add your credit card details.\nNeed more time? Contact our sales team—we’re happy to help extend your trial if needed.What is Copilot?▼Copilot is an AI-powered assistant in your inbox that helps customer support agents quickly find answers, troubleshoot issues, and respond to follow-up questions—saving time and allowing them to build stronger customer relationships.\nYou can add Copilot for $35 per user per month (subject to the Additional Product Terms for AI Products). Copilot is currently available for Zendesk and Salesforce.\nLearn more about Copilot here.What payment methods are accepted?▼For customers who sign up and pay online, we accept all major credit cards. To pay via ACH or wire, please contact our sales team.\nPlease note: Intercom is billed in United States Dollars (USD) only.Can I pay in my local currency?▼Intercom is billed in United States Dollars (USD) only. This includes Fin resolutions, additional usage charges, add-ons, and more. Right now, we can’t bill in any other currencies.Do you offer discounts for startups?▼There is an Early Stage program for eligible startups. You can find more information and apply for this program on this page.Get started with the #1 AI Agent todayStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/capabilities",
    "content": "Fin. The #1 AI Agent for customer service | Unmatched capabilities AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialComplete, fully configurable AI Agent systemFin is the only complete, fully configurable AI Agent System in customer service—empowering support teams to customize, test, and continuously improve Fin through a no-code user experience anyone can manage. [1]Start free trialView demo[1] Built on Fin AI Engine™Fin combines the only complete, fully configurable AI Agent System with a patented AI architecture to deliver the highest performance.Learn morecapabilities / analyzeImprove performance with AI-powered insightsMonitor, analyze, and optimize Fin's performance with a complete view across your entire customer experience. Spot trends, uncover insights and improve service quality with AI-powered Suggestions.newTopics ExplorerTopics Explorer uses AI to group every customer conversation into Topics and Subtopics—so you can spot patterns, track trends, and catch issues before they affect customer experience.Learn MorenewSuggestionsGet AI-generated content updates to improve Fin's answers. Suggestions can be accepted in a single click, and Fin will instantly begin using that content to deliver better answers and a better customer experience.Suggestions take the guesswork out of improving our content. With the help of weekly Suggestion reviews, we've increased our total resolution rate by 15%.Isabel Larrow,Product Support OperationsnewCX ScoreCX Score is a breakthrough, AI-powered metric that gives you a complete view of your support quality across every customer conversation—no surveys required.Performance DashboardMonitor key metrics like resolution rate, involvement rate, and CX Score in one view—making it easy to track Fin's performance, catch issues early, and communicate impact clearly across the business.newOptimize DashboardThe Optimize Dashboard features AI-powered Suggestions that highlight opportunities to improve Fin's performance. Accept with one click for instant optimization.only on intercom suiteFin custom reportingBuild your own Fin performance and quality reports with customizable report layouts, drag and drop charts, and advanced filters.Conversation monitoringEasily review Fin conversations in real time, directly from your Inbox.only on intercom suiteHolistic reportingGet visibility into the overall health of your entire support organization with a unified view of AI and human support in one detailed report.capabilities / trainConfigure Fin's behavior, tone, and actionsTrain Fin on your knowledge, data, policies, and tone of voice. Fin will use everything it knows to deliver consistent, accurate answers and handle complex tasks in +45 languages.Multi-source generative answersFin builds answers using only the most relevant information from multiple knowledge sources—creating more complete and accurate answers to even the most complex questions.Knowledge sourcesFin instantly learns from a variety of public and private knowledge sources, including Help Center articles, internal support content, PDFs, and URLs.Fin knowledge managementManage all of Fin's knowledge sources in one centralized Knowledge Hub—so Fin can access all the latest information as your business changes.Fin GuidanceFin can learn to behave like your best agents. Set Fin's communication style and define how it clarifies, escalates, and responds according to your support team's policies.Tone of voiceCustomize Fin's tone of voice and answer length to match your brand. Set preferences or preselect options like professional, friendly, or humorous.MultilingualFin will automatically detect and resolve issues in more than 45 languages, giving you full control over which languages you support.Real-time translationFin can translate support content written in any language to generate replies in the customer's language—no manual localization required.Content targetingDeliver more relevant answers by targeting content based on customer attributes like plan, location, or brand.new, beta availableFin TasksFin can handle complex requests, like issuing refunds or canceling orders. Simply describe the task in natural language, and Fin will follow the steps: gathering details, making decisions, and taking action with human oversight when needed.Personalized answersFin can retrieve information from your external systems to personalize customer interactions—surfacing details like account information, purchases, subscriptions, and more.Data connector templatesFin can take action across the data sources you use every day like Stripe, Shopify, Statuspage, and more. There's no code required, and AI helps prioritize which templates to set up first based on impact.Fin VisionFin can read, analyze and understand images—like screenshots, invoices, and error messages—so customers can share what they see without lengthy explanations.With Fin Guidance, you're able to tell Fin to read the customer's tone and frustration levels and take different actions based on that. That's a whole new world!Justin Mann,Business Operations Manager at MyTutorcapabilities / testEvaluate Fin's answers before going liveUse real customer questions to test Fin's answer quality and refine its sources and settings, so it always reflects your latest support content and policies.newBatch testingTest how ready your content is for Fin. Easily import conversations from your support inbox, other sources, or add them manually to evaluate Fin's accuracy and performance.newAnswer ratingReview and rate each of Fin's answers. Ratings and comments are captured in a report so you can prioritize what needs work and improve your content.Fin previewTest and refine Fin in real time. Instantly see how updates to guidance, deployment settings, or intro messages will appear to customers, helping you perfect the experience before going live.newAnswer inspectionGet full visibility into how Fin generated an answer. See exactly which sources and settings—like tone of voice and Guidance—shaped the response.newAudience testingTest how Fin answers for various customer types across multiple brands by simulating different audiences or personas.capabilities / deployLaunch Fin across channels and audiencesDeploy Fin across email, voice, live chat, social, and more. Fin can answer, triage, and collaborate with your team to deliver consistent experiences across channels.New, beta availableFin VoiceAI phone support, built for real conversations. Fin Voice answers calls naturally, handles complex questions, and connects customers to human agents exactly when it needs to.Fin over live chatWhether it's on your existing live chat tool, or the industry-leading Intercom Messenger—Fin delivers the best conversational support experience to your customers.Fin over emailFin is fully optimized for delivering support via email and can provide instant, accurate answers to customer questions, making sure to filter out phishing attempts, spam, and other threats.newFin over APIIntegrate Fin almost anywhere by using an API to deliver fast, accurate answers where your customers need them—without changing your existing systems.Fin over WhatsApp & SMSFin delivers conversational support across WhatsApp and SMS, to keep the customer experience consistent across all your channels.Fin over SocialFin can deliver conversational support experiences consistently on your social channels too, including Facebook and Instagram.coming soonFin over SlackFin delivers instant, accurate answers on Slack, scaling AI-first customer service to your busiest communities and threads.Workflows for FinAdd Fin to Workflow automations to triage, route, and generate answers when customers take specific actions—directly from Workflows no-code visual builder.Human handoffConfigure how and when Fin triages conversations or hands off to your human support team. Fin will always automatically handoff when that is the safest option for the customer.Audience targetingFin shows up for your customers how and when you decide—by audience, region, channel, and more—helping you stay in control and maintain support availability.Usage limits and notificationsSet resolution limits and receive notifications when Fin approaches them—or automatically stop Fin delivering AI answers once limits are reached.Our team naturally communicates with customers where they are, whether that's in Zendesk or Slack. Fin now works the same way, which is key for us.Lasse Høgsholt,Senior Technical Support Engineer at TinescopilotIncrease agent efficiency with a personal AI assistant in the inbox.Copilot works directly with your agents in the inbox, delivering instant advice, insights, and answers—so your team can work smarter, move faster, and focus on what matters most: delivering truly remarkable customer experiences.Learn moreGet started with the #1 AI Agent todayStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/contact-sales",
    "content": "Contact Sales | Fin AI Agent AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialDiscover what Fin can do for your customer serviceBusiness Email *Your company size *Select number of employees1-56-1516-4950-199200-9991000+Get updates about upcoming events, webinars, product announcements, and helpful resources.NextTrusted by more than 25,000 leading brandsMoneyboxCulture AmpClayLightspeedAnthropicMonday.comAmplitudeSynthesiaLaunchDarklyCodaShutterstockLovableConsensysAspireMarshmallowMoneyboxCulture AmpClayLightspeedAnthropicMonday.comAmplitudeSynthesiaLaunchDarklyCodaShutterstockLovableConsensysAspireMarshmallow"
  },
  {
    "url": "https://fin.ai/help/en",
    "content": "Fin by Intercom: Help CenterSkip to main contentSign upLearn moreEnglishEnglishSign upLearn moreEnglishEnglishHow can we help with Fin?Search for articles...Overview9 articlesAnalyze14 articlesTrain26 articlesTest3 articlesDeploy14 articlesSettings13 articlesPricing & Billing7 articlesFin Academy14 articlesFAQs3 articles The Fin Million Dollar GuaranteeFin is the best-performing AI Agent, consistently beating competitors in head-to-head evaluations. That’s why we offer the Fin Million Dollar Guarantee.Learn moreFin by Intercom: Help CenterThe first AI agent that delivers human-quality serviceYour Privacy Choices"
  },
  {
    "url": "https://fin.ai/customers",
    "content": "Fin | The most trusted AI Agent in customer service AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialNuulyLiving SpacesAvocado Green MattressButternut BoxShef, Inc.MoneysupermarketFlaviarKind PatchesAfterSell by ROKTOlybetHi-Rez StudiosBetr.appPocket WorldsDabbleGameBoostParlayPlayBlixx Gaming LtdWow VegasSagaCheckout.comConsensysKudaiDealsAspireMoneyboxMangopayAstroPayMarshmallowLendable3CommasTopstepWagestreamCEX.IOPayntMontonioZignalyKubo FinancieroPolymarketUniooSage UKFathomLightspeedMonday.comOnclusiveShutterstockTrueCommercePandaDocMoEngage Inc.MonotypeMatterportAmplitudePipefyMarcuraLaunchDarklyThoughtSpotYugabyte Inc.ClarotyCodaChess.comPlandayAnyRoadCloudinaryFlipdish LimitedPeople.aiTadoSynthesiaTinesDentallyAnthropicCanopyLivestormAhrefsEmployment heroEnerflotrumpetWebinarGeekScorebuddyLovableBreatheHeyreachHospitableconsensus.appGammaFugoClosebot.aichatPRDMy TutorwebScribbrCialfoOutschoolUp LearnOtusPfizerCera Care TechnologyShiftMedAAPCBeltoneZoeBirdieHeidi HealthNourishPure ElectricWPPSidekickerJoy LifeHallowNTETibberRoadRateMyAgentOTA InsightFresh Technologythe PoolsFirstyVinna.aiBoston Symphony OrchestraAnthrosFundriseCulture AmpClayKajabiNuulyLiving SpacesAvocado Green MattressButternut BoxShef, Inc.MoneysupermarketFlaviarKind PatchesAfterSell by ROKTOlybetHi-Rez StudiosBetr.appPocket WorldsDabbleGameBoostParlayPlayBlixx Gaming LtdWow VegasSagaCheckout.comConsensysKudaiDealsAspireMoneyboxMangopayAstroPayMarshmallowLendable3CommasTopstepWagestreamCEX.IOPayntMontonioZignalyKubo FinancieroPolymarketUniooSage UKFathomLightspeedMonday.comOnclusiveShutterstockTrueCommercePandaDocMoEngage Inc.MonotypeMatterportAmplitudePipefyMarcuraLaunchDarklyThoughtSpotYugabyte Inc.ClarotyCodaChess.comPlandayAnyRoadCloudinaryFlipdish LimitedPeople.aiTadoSynthesiaTinesDentallyAnthropicCanopyLivestormAhrefsEmployment heroEnerflotrumpetWebinarGeekScorebuddyLovableBreatheHeyreachHospitableconsensus.appGammaFugoClosebot.aichatPRDMy TutorwebScribbrCialfoOutschoolUp LearnOtusPfizerCera Care TechnologyShiftMedAAPCBeltoneZoeBirdieHeidi HealthNourishPure ElectricWPPSidekickerJoy LifeHallowNTETibberRoadRateMyAgentOTA InsightFresh Technologythe PoolsFirstyVinna.aiBoston Symphony OrchestraAnthrosFundriseCulture AmpClayKajabiNuulyLiving SpacesAvocado Green MattressButternut BoxShef, Inc.MoneysupermarketFlaviarKind PatchesAfterSell by ROKTOlybetHi-Rez StudiosBetr.appPocket WorldsDabbleGameBoostParlayPlayBlixx Gaming LtdWow VegasSagaCheckout.comConsensysKudaiDealsAspireMoneyboxMangopayAstroPayMarshmallowLendable3CommasTopstepWagestreamCEX.IOPayntMontonioZignalyKubo FinancieroPolymarketUniooSage UKFathomLightspeedMonday.comOnclusiveShutterstockTrueCommercePandaDocMoEngage Inc.MonotypeMatterportAmplitudePipefyMarcuraLaunchDarklyThoughtSpotYugabyte Inc.ClarotyCodaChess.comPlandayAnyRoadCloudinaryFlipdish LimitedPeople.aiTadoSynthesiaTinesDentallyAnthropicCanopyLivestormAhrefsEmployment heroEnerflotrumpetWebinarGeekScorebuddyLovableBreatheHeyreachHospitableconsensus.appGammaFugoClosebot.aichatPRDMy TutorwebScribbrCialfoOutschoolUp LearnOtusPfizerCera Care TechnologyShiftMedAAPCBeltoneZoeBirdieHeidi HealthNourishPure ElectricWPPSidekickerJoy LifeHallowNTETibberRoadRateMyAgentOTA InsightFresh Technologythe PoolsFirstyVinna.aiBoston Symphony OrchestraAnthrosFundriseCulture AmpClayKajabiNuulyLiving SpacesAvocado Green MattressButternut BoxShef, Inc.MoneysupermarketFlaviarKind PatchesAfterSell by ROKTOlybetHi-Rez StudiosBetr.appPocket WorldsDabbleGameBoostParlayPlayBlixx Gaming LtdWow VegasSagaCheckout.comConsensysKudaiDealsAspireMoneyboxMangopayAstroPayMarshmallowLendable3CommasTopstepWagestreamCEX.IOPayntMontonioZignalyKubo FinancieroPolymarketUniooSage UKFathomLightspeedMonday.comOnclusiveShutterstockTrueCommercePandaDocMoEngage Inc.MonotypeMatterportAmplitudePipefyMarcuraLaunchDarklyThoughtSpotYugabyte Inc.ClarotyCodaChess.comPlandayAnyRoadCloudinaryFlipdish LimitedPeople.aiTadoSynthesiaTinesDentallyAnthropicCanopyLivestormAhrefsEmployment heroEnerflotrumpetWebinarGeekScorebuddyLovableBreatheHeyreachHospitableconsensus.appGammaFugoClosebot.aichatPRDMy TutorwebScribbrCialfoOutschoolUp LearnOtusPfizerCera Care TechnologyShiftMedAAPCBeltoneZoeBirdieHeidi HealthNourishPure ElectricWPPSidekickerJoy LifeHallowNTETibberRoadRateMyAgentOTA InsightFresh Technologythe PoolsFirstyVinna.aiBoston Symphony OrchestraAnthrosFundriseCulture AmpClayKajabiNuulyLiving SpacesAvocado Green MattressButternut BoxShef, Inc.MoneysupermarketFlaviarKind PatchesAfterSell by ROKTOlybetHi-Rez StudiosBetr.appPocket WorldsDabbleGameBoostParlayPlayBlixx Gaming LtdWow VegasSagaCheckout.comConsensysKudaiDealsAspireMoneyboxMangopayAstroPayMarshmallowLendable3CommasTopstepWagestreamCEX.IOPayntMontonioZignalyKubo FinancieroPolymarketUniooSage UKFathomLightspeedMonday.comOnclusiveShutterstockTrueCommercePandaDocMoEngage Inc.MonotypeMatterportAmplitudePipefyMarcuraLaunchDarklyThoughtSpotYugabyte Inc.ClarotyCodaChess.comPlandayAnyRoadCloudinaryFlipdish LimitedPeople.aiTadoSynthesiaTinesDentallyAnthropicCanopyLivestormAhrefsEmployment heroEnerflotrumpetWebinarGeekScorebuddyLovableBreatheHeyreachHospitableconsensus.appGammaFugoClosebot.aichatPRDMy TutorwebScribbrCialfoOutschoolUp LearnOtusPfizerCera Care TechnologyShiftMedAAPCBeltoneZoeBirdieHeidi HealthNourishPure ElectricWPPSidekickerJoy LifeHallowNTETibberRoadRateMyAgentOTA InsightFresh Technologythe PoolsFirstyVinna.aiBoston Symphony OrchestraAnthrosFundriseCulture AmpClayKajabifin customersTrusted by thousands of customer service leaders, including the world's leading AI companiesClay“”Tatev AslanyanCustomer Happiness ManagerAnthropic“”Michael BlattnerVP of Customer SuccessMonday.com“”Barry P.Director of Customer SuccessLightspeed“”Frederik Vinding NielsenChief Customer OfficerCulture Amp“”Robb ClarkeHead of Tech OpsSynthesia“”George BushmelevBusiness Development DirectorLaunchDarkly“”Eric B.Director of Customer AccountsMoneybox“”Chris SinghCustomer Success MgrCoda“”Mark RummelVP of CXShutterstock“”Christian OsmundsenGlobal Head of CXAmplitude“”Thomas MainsTechnical WriterLovable“” Kostas S.Technical Support ManagerConsensys“”Will PattersonRevenue OperationsAspire“”Andika R.Product LeadMarshmallow“”Jamie S.Customer Support ManagerTines“”Ross P.Teacher Department HeadLinktree“”Peter CaputaCEO of DataboxFrends“”Dave GranfieldFounderYMCA“”Sam MeekCo-Founder & CEOClay“”Tatev AslanyanCustomer Happiness ManagerAnthropic“”Michael BlattnerVP of Customer SuccessMonday.com“”Barry P.Director of Customer SuccessLightspeed“”Frederik Vinding NielsenChief Customer OfficerCulture Amp“”Robb ClarkeHead of Tech OpsSynthesia“”George BushmelevBusiness Development DirectorLaunchDarkly“”Eric B.Director of Customer AccountsMoneybox“”Chris SinghCustomer Success MgrCoda“”Mark RummelVP of CXShutterstock“”Christian OsmundsenGlobal Head of CXAmplitude“”Thomas MainsTechnical WriterLovable“” Kostas S.Technical Support ManagerConsensys“”Will PattersonRevenue OperationsAspire“”Andika R.Product LeadMarshmallow“”Jamie S.Customer Support ManagerTines“”Ross P.Teacher Department HeadLinktree“”Peter CaputaCEO of DataboxFrends“”Dave GranfieldFounderYMCA“”Sam MeekCo-Founder & CEO“”Tatev AslanyanCustomer Happiness Manager“”Michael BlattnerVP of Customer Success“”Barry P.Director of Customer Success“”Frederik Vinding NielsenChief Customer Officer“”Robb ClarkeHead of Tech Ops“”George BushmelevBusiness Development Director“”Eric B.Director of Customer Accounts“”Chris SinghCustomer Success Mgr“”Mark RummelVP of CX“”Christian OsmundsenGlobal Head of CX“”Thomas MainsTechnical Writer“” Kostas S.Technical Support Manager“”Will PattersonRevenue Operations“”Andika R.Product Lead“”Jamie S.Customer Support Manager“”Ross P.Teacher Department Head“”Peter CaputaCEO of Databox“”Dave GranfieldFounder“”Sam MeekCo-Founder & CEO“”Tatev AslanyanCustomer Happiness Manager“”Michael BlattnerVP of Customer Success“”Barry P.Director of Customer Success“”Frederik Vinding NielsenChief Customer Officer“”Robb ClarkeHead of Tech Ops“”George BushmelevBusiness Development Director“”Eric B.Director of Customer Accounts“”Chris SinghCustomer Success Mgr“”Mark RummelVP of CX“”Christian OsmundsenGlobal Head of CX“”Thomas MainsTechnical Writer“” Kostas S.Technical Support Manager“”Will PattersonRevenue Operations“”Andika R.Product Lead“”Jamie S.Customer Support Manager“”Ross P.Teacher Department Head“”Peter CaputaCEO of Databox“”Dave GranfieldFounder“”Sam MeekCo-Founder & CEOClayAnthropicMonday.comLightspeedCulture AmpSynthesiaLaunchDarklyMoneyboxCodaShutterstockAmplitudeLovableConsensysAspireMarshmallowTinesLinktreeFrendsYMCAClayAnthropicMonday.comLightspeedCulture AmpSynthesiaLaunchDarklyMoneyboxCodaShutterstockAmplitudeLovableConsensysAspireMarshmallowTinesLinktreeFrendsYMCACustomer StoriesAll industriesRetail & eCommerceFinancial ServicesGamingSaaSRead moreClayTransparency and trust: Why Clay chose FinWith a rapidly-growing customer base, Clay wanted to scale support without sacrificing quality or its community-led approach. The team needed an AI agent that would give them transparency and control over the customer experience—so they chose Fin.With Jess Bergson and George Dilthey from Clay90%Fin Involvement Rate~7kSupport tickets managed per month90%Fin Involvement Rate~7kSupport tickets managed per monthPeddleRead moreLearn how Peddle saves $163K annually by cutting support volume in half with Fin.$163KAnnual Cost SavingsMonday.comGamma“Fin successfully managed 83% of conversations, leaving only 17% for our team.“Hilary DudekHead of Customer ExperienceConsensys“We saw quick success with Fin — reaching around a 50% resolution rate early on, and scaling that to over 70% over time, all while keeping customer satisfaction high.”Yair GalSupport LeadJared EllisSenior Director, Global Product SupportCulture Amp“With Fin we saw a 35-40% deflection rate just in our trial. The biggest win for me is that we haven’t compromised on the quality of the service we were providing. It's been delight after delight.“Jared EllisSenior Director, Global Product SupportRead moreAnthropicBuild vs. Buy. Why Anthropic chose FinPioneering AI research lab Anthropic could have easily chosen to build an in-house AI agent to power its customer service. But the team saw a greater opportunity to partner with a company with deep expertise in the CS space—which led them to Fin.With Emily Lampert and Isabel Larrow from Anthropic96%Fin involvement rate1,700Hours saved in first month96%Fin involvement rate1,700Hours saved in first monthDataboxRead moreLearn how Databox scaled support, increased efficiency, and grew revenue by 40% with Fin.40%Increase in new revenueAmplitudeLaunchDarkly“Fin has directly reduced our volume, which has taken a lot of pressure off our team.“Jolie KreschSenior Operations Lead, supportLovable“Fin’s given us new insights into our users that we just simply didn’t have before.“Nad ChrishtieFounding Designer\tLee BurkhillProject ManagerMoneySuperMarket“Complex reward or cashback claim queries used to mean hours, sometimes days, of team involvement. With Fin Tasks, we provide simple instructions, and Fin resolves these in minutes – calculating dates, verifying provider and product, and delivering immediate, clear answers to customers.”Lee BurkhillProject ManagerLoad moreGet started with the #1 AI Agent todayStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/capabilities#train",
    "content": "Fin. The #1 AI Agent for customer service | Unmatched capabilities AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialComplete, fully configurable AI Agent systemFin is the only complete, fully configurable AI Agent System in customer service—empowering support teams to customize, test, and continuously improve Fin through a no-code user experience anyone can manage. [1]Start free trialView demo[1] Built on Fin AI Engine™Fin combines the only complete, fully configurable AI Agent System with a patented AI architecture to deliver the highest performance.Learn morecapabilities / analyzeImprove performance with AI-powered insightsMonitor, analyze, and optimize Fin's performance with a complete view across your entire customer experience. Spot trends, uncover insights and improve service quality with AI-powered Suggestions.newTopics ExplorerTopics Explorer uses AI to group every customer conversation into Topics and Subtopics—so you can spot patterns, track trends, and catch issues before they affect customer experience.Learn MorenewSuggestionsGet AI-generated content updates to improve Fin's answers. Suggestions can be accepted in a single click, and Fin will instantly begin using that content to deliver better answers and a better customer experience.Suggestions take the guesswork out of improving our content. With the help of weekly Suggestion reviews, we've increased our total resolution rate by 15%.Isabel Larrow,Product Support OperationsnewCX ScoreCX Score is a breakthrough, AI-powered metric that gives you a complete view of your support quality across every customer conversation—no surveys required.Performance DashboardMonitor key metrics like resolution rate, involvement rate, and CX Score in one view—making it easy to track Fin's performance, catch issues early, and communicate impact clearly across the business.newOptimize DashboardThe Optimize Dashboard features AI-powered Suggestions that highlight opportunities to improve Fin's performance. Accept with one click for instant optimization.only on intercom suiteFin custom reportingBuild your own Fin performance and quality reports with customizable report layouts, drag and drop charts, and advanced filters.Conversation monitoringEasily review Fin conversations in real time, directly from your Inbox.only on intercom suiteHolistic reportingGet visibility into the overall health of your entire support organization with a unified view of AI and human support in one detailed report.capabilities / trainConfigure Fin's behavior, tone, and actionsTrain Fin on your knowledge, data, policies, and tone of voice. Fin will use everything it knows to deliver consistent, accurate answers and handle complex tasks in +45 languages.Multi-source generative answersFin builds answers using only the most relevant information from multiple knowledge sources—creating more complete and accurate answers to even the most complex questions.Knowledge sourcesFin instantly learns from a variety of public and private knowledge sources, including Help Center articles, internal support content, PDFs, and URLs.Fin knowledge managementManage all of Fin's knowledge sources in one centralized Knowledge Hub—so Fin can access all the latest information as your business changes.Fin GuidanceFin can learn to behave like your best agents. Set Fin's communication style and define how it clarifies, escalates, and responds according to your support team's policies.Tone of voiceCustomize Fin's tone of voice and answer length to match your brand. Set preferences or preselect options like professional, friendly, or humorous.MultilingualFin will automatically detect and resolve issues in more than 45 languages, giving you full control over which languages you support.Real-time translationFin can translate support content written in any language to generate replies in the customer's language—no manual localization required.Content targetingDeliver more relevant answers by targeting content based on customer attributes like plan, location, or brand.new, beta availableFin TasksFin can handle complex requests, like issuing refunds or canceling orders. Simply describe the task in natural language, and Fin will follow the steps: gathering details, making decisions, and taking action with human oversight when needed.Personalized answersFin can retrieve information from your external systems to personalize customer interactions—surfacing details like account information, purchases, subscriptions, and more.Data connector templatesFin can take action across the data sources you use every day like Stripe, Shopify, Statuspage, and more. There's no code required, and AI helps prioritize which templates to set up first based on impact.Fin VisionFin can read, analyze and understand images—like screenshots, invoices, and error messages—so customers can share what they see without lengthy explanations.With Fin Guidance, you're able to tell Fin to read the customer's tone and frustration levels and take different actions based on that. That's a whole new world!Justin Mann,Business Operations Manager at MyTutorcapabilities / testEvaluate Fin's answers before going liveUse real customer questions to test Fin's answer quality and refine its sources and settings, so it always reflects your latest support content and policies.newBatch testingTest how ready your content is for Fin. Easily import conversations from your support inbox, other sources, or add them manually to evaluate Fin's accuracy and performance.newAnswer ratingReview and rate each of Fin's answers. Ratings and comments are captured in a report so you can prioritize what needs work and improve your content.Fin previewTest and refine Fin in real time. Instantly see how updates to guidance, deployment settings, or intro messages will appear to customers, helping you perfect the experience before going live.newAnswer inspectionGet full visibility into how Fin generated an answer. See exactly which sources and settings—like tone of voice and Guidance—shaped the response.newAudience testingTest how Fin answers for various customer types across multiple brands by simulating different audiences or personas.capabilities / deployLaunch Fin across channels and audiencesDeploy Fin across email, voice, live chat, social, and more. Fin can answer, triage, and collaborate with your team to deliver consistent experiences across channels.New, beta availableFin VoiceAI phone support, built for real conversations. Fin Voice answers calls naturally, handles complex questions, and connects customers to human agents exactly when it needs to.Fin over live chatWhether it's on your existing live chat tool, or the industry-leading Intercom Messenger—Fin delivers the best conversational support experience to your customers.Fin over emailFin is fully optimized for delivering support via email and can provide instant, accurate answers to customer questions, making sure to filter out phishing attempts, spam, and other threats.newFin over APIIntegrate Fin almost anywhere by using an API to deliver fast, accurate answers where your customers need them—without changing your existing systems.Fin over WhatsApp & SMSFin delivers conversational support across WhatsApp and SMS, to keep the customer experience consistent across all your channels.Fin over SocialFin can deliver conversational support experiences consistently on your social channels too, including Facebook and Instagram.coming soonFin over SlackFin delivers instant, accurate answers on Slack, scaling AI-first customer service to your busiest communities and threads.Workflows for FinAdd Fin to Workflow automations to triage, route, and generate answers when customers take specific actions—directly from Workflows no-code visual builder.Human handoffConfigure how and when Fin triages conversations or hands off to your human support team. Fin will always automatically handoff when that is the safest option for the customer.Audience targetingFin shows up for your customers how and when you decide—by audience, region, channel, and more—helping you stay in control and maintain support availability.Usage limits and notificationsSet resolution limits and receive notifications when Fin approaches them—or automatically stop Fin delivering AI answers once limits are reached.Our team naturally communicates with customers where they are, whether that's in Zendesk or Slack. Fin now works the same way, which is key for us.Lasse Høgsholt,Senior Technical Support Engineer at TinescopilotIncrease agent efficiency with a personal AI assistant in the inbox.Copilot works directly with your agents in the inbox, delivering instant advice, insights, and answers—so your team can work smarter, move faster, and focus on what matters most: delivering truly remarkable customer experiences.Learn moreGet started with the #1 AI Agent todayStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/view-demos",
    "content": "See Fin in action | The highest performing AI Agent AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialFin Product DemoLooking to switch support platforms?Try Fin with Intercom "
  },
  {
    "url": "https://fin.ai/help/en/",
    "content": "Fin by Intercom: Help CenterSkip to main contentSign upLearn moreEnglishEnglishSign upLearn moreEnglishEnglishHow can we help with Fin?Search for articles...Overview9 articlesAnalyze14 articlesTrain26 articlesTest3 articlesDeploy14 articlesSettings13 articlesPricing & Billing7 articlesFin Academy14 articlesFAQs3 articles The Fin Million Dollar GuaranteeFin is the best-performing AI Agent, consistently beating competitors in head-to-head evaluations. That’s why we offer the Fin Million Dollar Guarantee.Learn moreFin by Intercom: Help CenterThe first AI agent that delivers human-quality serviceYour Privacy Choices"
  },
  {
    "url": "https://fin.ai/capabilities#analyze",
    "content": "Fin. The #1 AI Agent for customer service | Unmatched capabilities AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialComplete, fully configurable AI Agent systemFin is the only complete, fully configurable AI Agent System in customer service—empowering support teams to customize, test, and continuously improve Fin through a no-code user experience anyone can manage. [1]Start free trialView demo[1] Built on Fin AI Engine™Fin combines the only complete, fully configurable AI Agent System with a patented AI architecture to deliver the highest performance.Learn morecapabilities / analyzeImprove performance with AI-powered insightsMonitor, analyze, and optimize Fin's performance with a complete view across your entire customer experience. Spot trends, uncover insights and improve service quality with AI-powered Suggestions.newTopics ExplorerTopics Explorer uses AI to group every customer conversation into Topics and Subtopics—so you can spot patterns, track trends, and catch issues before they affect customer experience.Learn MorenewSuggestionsGet AI-generated content updates to improve Fin's answers. Suggestions can be accepted in a single click, and Fin will instantly begin using that content to deliver better answers and a better customer experience.Suggestions take the guesswork out of improving our content. With the help of weekly Suggestion reviews, we've increased our total resolution rate by 15%.Isabel Larrow,Product Support OperationsnewCX ScoreCX Score is a breakthrough, AI-powered metric that gives you a complete view of your support quality across every customer conversation—no surveys required.Performance DashboardMonitor key metrics like resolution rate, involvement rate, and CX Score in one view—making it easy to track Fin's performance, catch issues early, and communicate impact clearly across the business.newOptimize DashboardThe Optimize Dashboard features AI-powered Suggestions that highlight opportunities to improve Fin's performance. Accept with one click for instant optimization.only on intercom suiteFin custom reportingBuild your own Fin performance and quality reports with customizable report layouts, drag and drop charts, and advanced filters.Conversation monitoringEasily review Fin conversations in real time, directly from your Inbox.only on intercom suiteHolistic reportingGet visibility into the overall health of your entire support organization with a unified view of AI and human support in one detailed report.capabilities / trainConfigure Fin's behavior, tone, and actionsTrain Fin on your knowledge, data, policies, and tone of voice. Fin will use everything it knows to deliver consistent, accurate answers and handle complex tasks in +45 languages.Multi-source generative answersFin builds answers using only the most relevant information from multiple knowledge sources—creating more complete and accurate answers to even the most complex questions.Knowledge sourcesFin instantly learns from a variety of public and private knowledge sources, including Help Center articles, internal support content, PDFs, and URLs.Fin knowledge managementManage all of Fin's knowledge sources in one centralized Knowledge Hub—so Fin can access all the latest information as your business changes.Fin GuidanceFin can learn to behave like your best agents. Set Fin's communication style and define how it clarifies, escalates, and responds according to your support team's policies.Tone of voiceCustomize Fin's tone of voice and answer length to match your brand. Set preferences or preselect options like professional, friendly, or humorous.MultilingualFin will automatically detect and resolve issues in more than 45 languages, giving you full control over which languages you support.Real-time translationFin can translate support content written in any language to generate replies in the customer's language—no manual localization required.Content targetingDeliver more relevant answers by targeting content based on customer attributes like plan, location, or brand.new, beta availableFin TasksFin can handle complex requests, like issuing refunds or canceling orders. Simply describe the task in natural language, and Fin will follow the steps: gathering details, making decisions, and taking action with human oversight when needed.Personalized answersFin can retrieve information from your external systems to personalize customer interactions—surfacing details like account information, purchases, subscriptions, and more.Data connector templatesFin can take action across the data sources you use every day like Stripe, Shopify, Statuspage, and more. There's no code required, and AI helps prioritize which templates to set up first based on impact.Fin VisionFin can read, analyze and understand images—like screenshots, invoices, and error messages—so customers can share what they see without lengthy explanations.With Fin Guidance, you're able to tell Fin to read the customer's tone and frustration levels and take different actions based on that. That's a whole new world!Justin Mann,Business Operations Manager at MyTutorcapabilities / testEvaluate Fin's answers before going liveUse real customer questions to test Fin's answer quality and refine its sources and settings, so it always reflects your latest support content and policies.newBatch testingTest how ready your content is for Fin. Easily import conversations from your support inbox, other sources, or add them manually to evaluate Fin's accuracy and performance.newAnswer ratingReview and rate each of Fin's answers. Ratings and comments are captured in a report so you can prioritize what needs work and improve your content.Fin previewTest and refine Fin in real time. Instantly see how updates to guidance, deployment settings, or intro messages will appear to customers, helping you perfect the experience before going live.newAnswer inspectionGet full visibility into how Fin generated an answer. See exactly which sources and settings—like tone of voice and Guidance—shaped the response.newAudience testingTest how Fin answers for various customer types across multiple brands by simulating different audiences or personas.capabilities / deployLaunch Fin across channels and audiencesDeploy Fin across email, voice, live chat, social, and more. Fin can answer, triage, and collaborate with your team to deliver consistent experiences across channels.New, beta availableFin VoiceAI phone support, built for real conversations. Fin Voice answers calls naturally, handles complex questions, and connects customers to human agents exactly when it needs to.Fin over live chatWhether it's on your existing live chat tool, or the industry-leading Intercom Messenger—Fin delivers the best conversational support experience to your customers.Fin over emailFin is fully optimized for delivering support via email and can provide instant, accurate answers to customer questions, making sure to filter out phishing attempts, spam, and other threats.newFin over APIIntegrate Fin almost anywhere by using an API to deliver fast, accurate answers where your customers need them—without changing your existing systems.Fin over WhatsApp & SMSFin delivers conversational support across WhatsApp and SMS, to keep the customer experience consistent across all your channels.Fin over SocialFin can deliver conversational support experiences consistently on your social channels too, including Facebook and Instagram.coming soonFin over SlackFin delivers instant, accurate answers on Slack, scaling AI-first customer service to your busiest communities and threads.Workflows for FinAdd Fin to Workflow automations to triage, route, and generate answers when customers take specific actions—directly from Workflows no-code visual builder.Human handoffConfigure how and when Fin triages conversations or hands off to your human support team. Fin will always automatically handoff when that is the safest option for the customer.Audience targetingFin shows up for your customers how and when you decide—by audience, region, channel, and more—helping you stay in control and maintain support availability.Usage limits and notificationsSet resolution limits and receive notifications when Fin approaches them—or automatically stop Fin delivering AI answers once limits are reached.Our team naturally communicates with customers where they are, whether that's in Zendesk or Slack. Fin now works the same way, which is key for us.Lasse Høgsholt,Senior Technical Support Engineer at TinescopilotIncrease agent efficiency with a personal AI assistant in the inbox.Copilot works directly with your agents in the inbox, delivering instant advice, insights, and answers—so your team can work smarter, move faster, and focus on what matters most: delivering truly remarkable customer experiences.Learn moreGet started with the #1 AI Agent todayStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/capabilities#test",
    "content": "Fin. The #1 AI Agent for customer service | Unmatched capabilities AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialComplete, fully configurable AI Agent systemFin is the only complete, fully configurable AI Agent System in customer service—empowering support teams to customize, test, and continuously improve Fin through a no-code user experience anyone can manage. [1]Start free trialView demo[1] Built on Fin AI Engine™Fin combines the only complete, fully configurable AI Agent System with a patented AI architecture to deliver the highest performance.Learn morecapabilities / analyzeImprove performance with AI-powered insightsMonitor, analyze, and optimize Fin's performance with a complete view across your entire customer experience. Spot trends, uncover insights and improve service quality with AI-powered Suggestions.newTopics ExplorerTopics Explorer uses AI to group every customer conversation into Topics and Subtopics—so you can spot patterns, track trends, and catch issues before they affect customer experience.Learn MorenewSuggestionsGet AI-generated content updates to improve Fin's answers. Suggestions can be accepted in a single click, and Fin will instantly begin using that content to deliver better answers and a better customer experience.Suggestions take the guesswork out of improving our content. With the help of weekly Suggestion reviews, we've increased our total resolution rate by 15%.Isabel Larrow,Product Support OperationsnewCX ScoreCX Score is a breakthrough, AI-powered metric that gives you a complete view of your support quality across every customer conversation—no surveys required.Performance DashboardMonitor key metrics like resolution rate, involvement rate, and CX Score in one view—making it easy to track Fin's performance, catch issues early, and communicate impact clearly across the business.newOptimize DashboardThe Optimize Dashboard features AI-powered Suggestions that highlight opportunities to improve Fin's performance. Accept with one click for instant optimization.only on intercom suiteFin custom reportingBuild your own Fin performance and quality reports with customizable report layouts, drag and drop charts, and advanced filters.Conversation monitoringEasily review Fin conversations in real time, directly from your Inbox.only on intercom suiteHolistic reportingGet visibility into the overall health of your entire support organization with a unified view of AI and human support in one detailed report.capabilities / trainConfigure Fin's behavior, tone, and actionsTrain Fin on your knowledge, data, policies, and tone of voice. Fin will use everything it knows to deliver consistent, accurate answers and handle complex tasks in +45 languages.Multi-source generative answersFin builds answers using only the most relevant information from multiple knowledge sources—creating more complete and accurate answers to even the most complex questions.Knowledge sourcesFin instantly learns from a variety of public and private knowledge sources, including Help Center articles, internal support content, PDFs, and URLs.Fin knowledge managementManage all of Fin's knowledge sources in one centralized Knowledge Hub—so Fin can access all the latest information as your business changes.Fin GuidanceFin can learn to behave like your best agents. Set Fin's communication style and define how it clarifies, escalates, and responds according to your support team's policies.Tone of voiceCustomize Fin's tone of voice and answer length to match your brand. Set preferences or preselect options like professional, friendly, or humorous.MultilingualFin will automatically detect and resolve issues in more than 45 languages, giving you full control over which languages you support.Real-time translationFin can translate support content written in any language to generate replies in the customer's language—no manual localization required.Content targetingDeliver more relevant answers by targeting content based on customer attributes like plan, location, or brand.new, beta availableFin TasksFin can handle complex requests, like issuing refunds or canceling orders. Simply describe the task in natural language, and Fin will follow the steps: gathering details, making decisions, and taking action with human oversight when needed.Personalized answersFin can retrieve information from your external systems to personalize customer interactions—surfacing details like account information, purchases, subscriptions, and more.Data connector templatesFin can take action across the data sources you use every day like Stripe, Shopify, Statuspage, and more. There's no code required, and AI helps prioritize which templates to set up first based on impact.Fin VisionFin can read, analyze and understand images—like screenshots, invoices, and error messages—so customers can share what they see without lengthy explanations.With Fin Guidance, you're able to tell Fin to read the customer's tone and frustration levels and take different actions based on that. That's a whole new world!Justin Mann,Business Operations Manager at MyTutorcapabilities / testEvaluate Fin's answers before going liveUse real customer questions to test Fin's answer quality and refine its sources and settings, so it always reflects your latest support content and policies.newBatch testingTest how ready your content is for Fin. Easily import conversations from your support inbox, other sources, or add them manually to evaluate Fin's accuracy and performance.newAnswer ratingReview and rate each of Fin's answers. Ratings and comments are captured in a report so you can prioritize what needs work and improve your content.Fin previewTest and refine Fin in real time. Instantly see how updates to guidance, deployment settings, or intro messages will appear to customers, helping you perfect the experience before going live.newAnswer inspectionGet full visibility into how Fin generated an answer. See exactly which sources and settings—like tone of voice and Guidance—shaped the response.newAudience testingTest how Fin answers for various customer types across multiple brands by simulating different audiences or personas.capabilities / deployLaunch Fin across channels and audiencesDeploy Fin across email, voice, live chat, social, and more. Fin can answer, triage, and collaborate with your team to deliver consistent experiences across channels.New, beta availableFin VoiceAI phone support, built for real conversations. Fin Voice answers calls naturally, handles complex questions, and connects customers to human agents exactly when it needs to.Fin over live chatWhether it's on your existing live chat tool, or the industry-leading Intercom Messenger—Fin delivers the best conversational support experience to your customers.Fin over emailFin is fully optimized for delivering support via email and can provide instant, accurate answers to customer questions, making sure to filter out phishing attempts, spam, and other threats.newFin over APIIntegrate Fin almost anywhere by using an API to deliver fast, accurate answers where your customers need them—without changing your existing systems.Fin over WhatsApp & SMSFin delivers conversational support across WhatsApp and SMS, to keep the customer experience consistent across all your channels.Fin over SocialFin can deliver conversational support experiences consistently on your social channels too, including Facebook and Instagram.coming soonFin over SlackFin delivers instant, accurate answers on Slack, scaling AI-first customer service to your busiest communities and threads.Workflows for FinAdd Fin to Workflow automations to triage, route, and generate answers when customers take specific actions—directly from Workflows no-code visual builder.Human handoffConfigure how and when Fin triages conversations or hands off to your human support team. Fin will always automatically handoff when that is the safest option for the customer.Audience targetingFin shows up for your customers how and when you decide—by audience, region, channel, and more—helping you stay in control and maintain support availability.Usage limits and notificationsSet resolution limits and receive notifications when Fin approaches them—or automatically stop Fin delivering AI answers once limits are reached.Our team naturally communicates with customers where they are, whether that's in Zendesk or Slack. Fin now works the same way, which is key for us.Lasse Høgsholt,Senior Technical Support Engineer at TinescopilotIncrease agent efficiency with a personal AI assistant in the inbox.Copilot works directly with your agents in the inbox, delivering instant advice, insights, and answers—so your team can work smarter, move faster, and focus on what matters most: delivering truly remarkable customer experiences.Learn moreGet started with the #1 AI Agent todayStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/capabilities#deploy",
    "content": "Fin. The #1 AI Agent for customer service | Unmatched capabilities AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialComplete, fully configurable AI Agent systemFin is the only complete, fully configurable AI Agent System in customer service—empowering support teams to customize, test, and continuously improve Fin through a no-code user experience anyone can manage. [1]Start free trialView demo[1] Built on Fin AI Engine™Fin combines the only complete, fully configurable AI Agent System with a patented AI architecture to deliver the highest performance.Learn morecapabilities / analyzeImprove performance with AI-powered insightsMonitor, analyze, and optimize Fin's performance with a complete view across your entire customer experience. Spot trends, uncover insights and improve service quality with AI-powered Suggestions.newTopics ExplorerTopics Explorer uses AI to group every customer conversation into Topics and Subtopics—so you can spot patterns, track trends, and catch issues before they affect customer experience.Learn MorenewSuggestionsGet AI-generated content updates to improve Fin's answers. Suggestions can be accepted in a single click, and Fin will instantly begin using that content to deliver better answers and a better customer experience.Suggestions take the guesswork out of improving our content. With the help of weekly Suggestion reviews, we've increased our total resolution rate by 15%.Isabel Larrow,Product Support OperationsnewCX ScoreCX Score is a breakthrough, AI-powered metric that gives you a complete view of your support quality across every customer conversation—no surveys required.Performance DashboardMonitor key metrics like resolution rate, involvement rate, and CX Score in one view—making it easy to track Fin's performance, catch issues early, and communicate impact clearly across the business.newOptimize DashboardThe Optimize Dashboard features AI-powered Suggestions that highlight opportunities to improve Fin's performance. Accept with one click for instant optimization.only on intercom suiteFin custom reportingBuild your own Fin performance and quality reports with customizable report layouts, drag and drop charts, and advanced filters.Conversation monitoringEasily review Fin conversations in real time, directly from your Inbox.only on intercom suiteHolistic reportingGet visibility into the overall health of your entire support organization with a unified view of AI and human support in one detailed report.capabilities / trainConfigure Fin's behavior, tone, and actionsTrain Fin on your knowledge, data, policies, and tone of voice. Fin will use everything it knows to deliver consistent, accurate answers and handle complex tasks in +45 languages.Multi-source generative answersFin builds answers using only the most relevant information from multiple knowledge sources—creating more complete and accurate answers to even the most complex questions.Knowledge sourcesFin instantly learns from a variety of public and private knowledge sources, including Help Center articles, internal support content, PDFs, and URLs.Fin knowledge managementManage all of Fin's knowledge sources in one centralized Knowledge Hub—so Fin can access all the latest information as your business changes.Fin GuidanceFin can learn to behave like your best agents. Set Fin's communication style and define how it clarifies, escalates, and responds according to your support team's policies.Tone of voiceCustomize Fin's tone of voice and answer length to match your brand. Set preferences or preselect options like professional, friendly, or humorous.MultilingualFin will automatically detect and resolve issues in more than 45 languages, giving you full control over which languages you support.Real-time translationFin can translate support content written in any language to generate replies in the customer's language—no manual localization required.Content targetingDeliver more relevant answers by targeting content based on customer attributes like plan, location, or brand.new, beta availableFin TasksFin can handle complex requests, like issuing refunds or canceling orders. Simply describe the task in natural language, and Fin will follow the steps: gathering details, making decisions, and taking action with human oversight when needed.Personalized answersFin can retrieve information from your external systems to personalize customer interactions—surfacing details like account information, purchases, subscriptions, and more.Data connector templatesFin can take action across the data sources you use every day like Stripe, Shopify, Statuspage, and more. There's no code required, and AI helps prioritize which templates to set up first based on impact.Fin VisionFin can read, analyze and understand images—like screenshots, invoices, and error messages—so customers can share what they see without lengthy explanations.With Fin Guidance, you're able to tell Fin to read the customer's tone and frustration levels and take different actions based on that. That's a whole new world!Justin Mann,Business Operations Manager at MyTutorcapabilities / testEvaluate Fin's answers before going liveUse real customer questions to test Fin's answer quality and refine its sources and settings, so it always reflects your latest support content and policies.newBatch testingTest how ready your content is for Fin. Easily import conversations from your support inbox, other sources, or add them manually to evaluate Fin's accuracy and performance.newAnswer ratingReview and rate each of Fin's answers. Ratings and comments are captured in a report so you can prioritize what needs work and improve your content.Fin previewTest and refine Fin in real time. Instantly see how updates to guidance, deployment settings, or intro messages will appear to customers, helping you perfect the experience before going live.newAnswer inspectionGet full visibility into how Fin generated an answer. See exactly which sources and settings—like tone of voice and Guidance—shaped the response.newAudience testingTest how Fin answers for various customer types across multiple brands by simulating different audiences or personas.capabilities / deployLaunch Fin across channels and audiencesDeploy Fin across email, voice, live chat, social, and more. Fin can answer, triage, and collaborate with your team to deliver consistent experiences across channels.New, beta availableFin VoiceAI phone support, built for real conversations. Fin Voice answers calls naturally, handles complex questions, and connects customers to human agents exactly when it needs to.Fin over live chatWhether it's on your existing live chat tool, or the industry-leading Intercom Messenger—Fin delivers the best conversational support experience to your customers.Fin over emailFin is fully optimized for delivering support via email and can provide instant, accurate answers to customer questions, making sure to filter out phishing attempts, spam, and other threats.newFin over APIIntegrate Fin almost anywhere by using an API to deliver fast, accurate answers where your customers need them—without changing your existing systems.Fin over WhatsApp & SMSFin delivers conversational support across WhatsApp and SMS, to keep the customer experience consistent across all your channels.Fin over SocialFin can deliver conversational support experiences consistently on your social channels too, including Facebook and Instagram.coming soonFin over SlackFin delivers instant, accurate answers on Slack, scaling AI-first customer service to your busiest communities and threads.Workflows for FinAdd Fin to Workflow automations to triage, route, and generate answers when customers take specific actions—directly from Workflows no-code visual builder.Human handoffConfigure how and when Fin triages conversations or hands off to your human support team. Fin will always automatically handoff when that is the safest option for the customer.Audience targetingFin shows up for your customers how and when you decide—by audience, region, channel, and more—helping you stay in control and maintain support availability.Usage limits and notificationsSet resolution limits and receive notifications when Fin approaches them—or automatically stop Fin delivering AI answers once limits are reached.Our team naturally communicates with customers where they are, whether that's in Zendesk or Slack. Fin now works the same way, which is key for us.Lasse Høgsholt,Senior Technical Support Engineer at TinescopilotIncrease agent efficiency with a personal AI assistant in the inbox.Copilot works directly with your agents in the inbox, delivering instant advice, insights, and answers—so your team can work smarter, move faster, and focus on what matters most: delivering truly remarkable customer experiences.Learn moreGet started with the #1 AI Agent todayStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/ideas/",
    "content": "\n\n\n\n\n\n\n\n\n\n\n\nAbout - Fin Ideas Blog\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to main content\n\n\n\n\nView Posts\n\n\n\n\nMarketing in an AI World\nBe careful you don’t build a MiniDisc\n2x\nWhy an AI-driven Customer Experience Score will replace human-surveyed CSAT\nAI CS Part 1: Understanding Resolution Rates\nWhy do we expect our AI products to be flawless?\nGood Bot / Bad Bot\nAn AI conundrum: Products or Partnerships\n✨Sparkling Specificity✨\nThe timeline to fully automated Customer Service\nInconvenient truths about how we measure Customer Service, and how AI will save us\nBuild vs buy: The high bar for building your own AI agent\nWatch: Demos and Prototypes\n\n\n About\n \n\n\n\nHi    : )\nAt Intercom, we’re building the best AI Agent and Platform for Customer Service.\nWe’re at the cutting edge of what is possible, shipping to tens of thousands of customers, and to millions of their customers. We’ve already built a deep AI product, but are learning hard and fast. No-one has yet figured out product-market fit for AI products, we are still very early in this technology cycle.\nEvery day, there are many great conversations internally about the rapid pace of technology change and what it might mean. We want to share some of those conversations, and hopefully spark some discussions and debate, so that we can all learn together as an industry, and ultimately build better products.\nWe’d love to hear from you!\n\nPaul AdamsChief Product Officer\n\nDes TraynorCo-founder and Chief Strategy Officer\nFebruary 2025\n\n\n\n\n\n\n\n\n\nPlease leave this field empty\nGet notified when we post on /ideas.\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
  },
  {
    "url": "https://fin.ai/ai-engine",
    "content": "The Fin AI Engine™: Powering Next-Gen AI Support | Intercom AllFinThe best performing AI Agent in customer serviceIntercom SuiteOne platform with Fin AI Agent and a complete HelpdeskHelpdeskThe next-gen Helpdesk designed for efficiencyHomeCapabilitiesAI EngineAI ResearchCustomersResourcesEventsPioneerJoin visionary customer service leaders at Intercom's flagship event.Built For YouCatch up on our latest launch event, showcasing our newest AI innovations.WebinarsDiscover support discussions, case studies, demos, and more content.LearnHelp CenterExplore our support docs to get up and running with Fin AI Agent.Safety & SecurityThe highest standards for safety and security.Ideas BlogIdeas on building and leading in the AI era.PricingContact salesSign inView demoStart free trialHomeCapabilitiesAI EngineAI ResearchCustomersResourcesPricingContact salesSign inView demoStart free trialAI engineered for precision, speed, and reliability.The patented Fin AI Engine™ allows Fin to refine every query, optimize every response and validate the quality of each answer. That’s why Fin is the only AI Agent that can balance industry-high resolutions with industry-low hallucinations, making it the highest-performing and safest AI Agent in customer service.Start free trialView demoPhase 1Refine the queryIn order to optimize the accuracy of an answer that an LLM generates, the inputs the LLM receives must be refined for comprehension. The clearer and more understandable the query, the better the output.Specification1.1Check for safety and relevance1.2Optimize query comprehension1.3Check for Workflows automation1.4Check for Custom AnswerLearn morePhase 2Generate a responseOnce a query has been checked and optimized the next stage is to generate a response using the LLM. For this task, the Fin AI Engine™ has been designed to use a bespoke and enhanced retrieval augmented generation architecture (RAG for short).Specification2.1Optimize retrieval2.2Integrate and augment2.3Generate responseLearn morePhase 3Validate accuracyIn the final step of the process, the Fin AI Engine™ performs checks to understand whether the output from the LLM meets the necessary response accuracy and safety standards.Specification3.1Validate the response3.2Respond to customerLearn morealways-onEngine optimizationTo calibrate and enhance engine performance, the Fin AI Engine™ has advanced integrated tools that help optimize answer generation, efficiency, precision, and coverage.Specification4.1Fin customization and control4.2AI analytics and reporting4.3AI recommendationsLearn moresafeguardingAI Trust & SecurityIntercom has implemented state-of-the-art security measures to protect Fin against a wide range of LLM threats, including those identified by the OWASP LLM Top 10. By consistently testing a variety of high-end LLMs, and deploying rigorous internal controls, security protocols, and safeguards, Fin is able to achieve the highest level of security and reliability while avoiding potential limitations and threats.Specification5.1Fin AI Security5.2Regional hosting5.3Compliance: International Standards5.4Third-party AI ProvidersLearn moreGet the highest-performing AI AgentStart free trialGet a demoProductFin OverviewCapabilitiesAI EngineFin InsightsPricingIntercom SuiteResearchAI ResearchResourcesCustomersIdeas BlogHelp CenterSecurity & safetyEventsPioneerBuilt For YouWebinarsFin in actionView demoFree trialContact salesSign inProduct▼Research▼Resources▼Events▼Fin in action▲View demoFree trialContact salesSign inTermsPrivacySecurityYour Privacy ChoicesAn Intercom Product"
  },
  {
    "url": "https://fin.ai/research/",
    "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n/research - Insights from the AI Group building Fin\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to main content\n\n\n\n\n\n\n\n\n\n\n/research\nInsights from the AI Group building Fin\n\n\n\n\n\nThe Agency, Control, Reliability (ACR) Tradeoff for Agents\n\nWe experiment with the strategy of developing composable AI agents with slightly tempered autonomy. The resulting agent exhibits vastly improved reliability, and performance. \n\nSagar Joglekar \n\n\t\t\t\t\tRead\t\t\t\t\n\n\n\n \n\n\n\n\n\nArticles\n3\n\n\n\n\n\n\n\n\n\t\t\t\tDo you really need a Vector Search Database?\t\t\t\n\n\n\nKetan Bhatt \n\n\n\t\t\t2025.04.29\t\t\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\tAn Actor-Critic Approach to Reduce Hallucinations\t\t\t\n\n\n\nFedor Parfenov \n\n\n\t\t\t2025.04.10\t\t\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\tSlower Feels Smarter? Experimenting with AI Agent Latency\t\t\t\n\n\n\nPedro Tabacof \n\n\n\t\t\t2025.04.10\t\t\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
  }
]